--region 图形描述
-- 上下双直线，中间是两个圆
--  * * * * * * * * * * * * * * * * * * * * * * * * 
--          *  * 
--        *     *
--       *   *   *
--         *   *
--           * 
--  * * * * * * * * * * * * * * * * * * * * * * * * 
--endregion

local fishjoy_scenepath_1 = {
	t = 25,         --首条鱼时间，后面会根据这个判断一个速度进行时间的加减

	upt = 1, 		--上边鱼种类
	upc = 30, 		--上边鱼数
	upy = 550,      --上边鱼位置
	upx = 1295,     --上边鱼起始位置
	updx = -25,     --上边鱼目标x
	upi = 47,       --上边鱼间隔

	dwt = 1, 		--下边鱼种类
	dwc = 30,       --下边鱼数量
	dwy = 170,      --下边鱼位置
	dwx = 1295,     --下边鱼起始位置
	dwdx = -25,     --下边鱼目标x
	dwi = 47,       --下边鱼间隔

	ct = 20,        --中心鱼种类
	cx = {1445, 1765, 2085},  	--三个圆
	cy = 360,       --中心鱼y
	cdx = -40,      --中心鱼目标x
	r = 150,        --圆半径
	rt = 2,         --圆鱼类型
	rc = 32,        --圆上鱼的数量 rc % 4 == 0
}

return fishjoy_scenepath_1